УчетВУправляющихДляГит1/src/Documents/НачислениеПеней/НачислениеПеней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПеней</name>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаПени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задолженность</name>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СписаниеСРасчетногоСчета</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ГТДИмпорт</types>
        <types>DocumentRef.КорректировкаПоступления</types>
        <types>DocumentRef.ВыкупПредметовЛизинга</types>
        <types>DocumentRef.ВыдачаДенежныхДокументов</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ОказаниеУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
        <types>DocumentRef.ОтражениеНДСКВычету</types>
        <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Просрочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/ВидыРегламентныхОпераций/ВидыРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРегламентныхОпераций</name>
  <enumValues>
    <name>НачислениеЗарплаты</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеРезерваОтпусков</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеНДС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияИИзносОС</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНУЛизинговыхПлатежей</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМАИсписаниеРасходовПоНИОКР</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПереоценкаВалютныхСредств</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаСтоимостиНоменклатуры</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчета97</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТорговойНаценкиПоПроданнымТоварам</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовНаПриобретениеОСДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеДопРасходовДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеТаможенныхПлатежейДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетДолейСписанияКосвенныхРасходов</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетов20_23_25_26</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчета44</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РасчетРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ВключениеАвансовВПрочиеДоходыДляИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоВидамДеятельностиДляУСН</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоВидамДеятельностиДляИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеСтраховыхВзносовИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РасчетРасходовУменьшающихОтдельныеНалоги</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетов90_91</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеУбытковПрошлыхЛет</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаПрибыль</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетОтложенногоНалога</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетЕНВД</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РеформацияБаланса</name>
    <comment>4</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/НачислениеПеней/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.НачислениеПеней.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Документы.НачислениеПеней.СформироватьДвиженияНачислениеПени(ПараметрыПроведения.НачислениеПени, ПараметрыПроведения.Реквизиты, 
		Движения, Отказ);
		
	Документы.НачислениеПеней.СформироватьДвиженияНДСЗаписиКнигиПродаж(ПараметрыПроведения.НачислениеПени, ПараметрыПроведения.Реквизиты, 
		Движения, Отказ);

	// Отложенные расчеты с контрагентами.
	УчетВзаиморасчетовОтложенноеПроведение.ЗарегистрироватьОтложенныеРасчетыСКонтрагентами(
		ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);
		
	// Регистрация в последовательности.
	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
		ЭтотОбъект,
		Отказ,
		ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение,
		,
		Перечисления.ВидыРегламентныхОпераций.РасчетДолейСписанияКосвенныхРасходов);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);

	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорПередЗаписью(ЭтотОбъект);
	
	СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ЭтотОбъект, РежимЗаписи);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	СчетаУчетаВДокументах.ПроверитьЗаполнение(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
